<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ---------------------------------------- 0.0/6.0 MB ? eta -:--:--
     ------- -------------------------------- 1.0/6.0 MB 16.7 MB/s eta 0:00:01
     -------------- ------------------------- 2.1/6.0 MB 5.3 MB/s eta 0:00:01
     -------------- ------------------------- 2.1/6.0 MB 5.3 MB/s eta 0:00:01
     --------------------- ------------------ 3.1/6.0 MB 4.3 MB/s eta 0:00:01
     --------------------- ------------------ 3.1/6.0 MB 4.3 MB/s eta 0:00:01
     ---------------------------- ----------- 4.2/6.0 MB 3.4 MB/s eta 0:00:01
     ---------------------------- ----------- 4.2/6.0 MB 3.4 MB/s eta 0:00:01
     ----------------------------------- ---- 5.2/6.0 MB 3.1 MB/s eta 0:00:01
     -------------------------------------- - 5.8/6.0 MB 3.0 MB/s eta 0:00:01
     ---------------------------------------- 6.0/6.0 MB 3.0 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (pyproject.toml): started
  Building wheel for sqlalchemy (pyproject.toml): finished with status 'done'
  Created wheel for sqlalchemy: filename=sqlalchemy-1.3.9-cp312-cp312-win_amd64.whl size=1143039 sha256=353d13cdeb8972c96033a37ed31213a1cff14fbd089f5a08c96a65880490b1ce
  Stored in directory: c:\users\ramkumar.pandidurai\appdata\local\pip\cache\wheels\b3\1c\42\0e26b8d512adc6bce10ff71a05229366b4ccec641cd3b42111
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.44
    Uninstalling SQLAlchemy-2.0.44:
      Successfully uninstalled SQLAlchemy-2.0.44
Successfully installed sqlalchemy-1.3.9

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
ipython-sql 0.5.0 requires sqlalchemy>=2.0, but you have sqlalchemy 1.3.9 which is incompatible.

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
!pip install ipython-sql
!pip install ipython-sql prettytable

Requirement already satisfied: ipython-sql in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (9.7.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading sqlalchemy-2.0.45-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Requirement already satisfied: sqlparse in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (0.5.4)
Requirement already satisfied: six in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: colorama>=0.4.4 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator>=4.3.2 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers>=1.0.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.18.1 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline>=0.1.5 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments>=2.11.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: stack_data>=0.6.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from prettytable->ipython-sql) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from jedi>=0.18.1->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: executing>=1.2.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (3.0.1)
Requirement already satisfied: pure-eval in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (0.2.3)
Downloading sqlalchemy-2.0.45-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 13.3 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed sqlalchemy-2.0.45

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: ipython-sql in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (3.17.0)
Requirement already satisfied: ipython in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (9.7.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (2.0.45)
Requirement already satisfied: sqlparse in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (0.5.4)
Requirement already satisfied: six in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from prettytable) (0.2.14)
Requirement already satisfied: greenlet>=1 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: colorama>=0.4.4 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator>=4.3.2 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers>=1.0.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.18.1 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline>=0.1.5 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments>=2.11.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: stack_data>=0.6.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from jedi>=0.18.1->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: executing>=1.2.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (3.0.1)
Requirement already satisfied: pure-eval in c:\users\ramkumar.pandidurai\documents\coursera_jupyternotebook\.venv\lib\site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (0.2.3)

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
!pip install -q pandas

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
%sql sqlite:///my_data1.db

In [7]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

**Note:This below code is added to remove blank rows from table**

In [8]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [9]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [10]:
df = %sql select * from SPACEXTABLE
df = df.DataFrame()
df.head()

 * sqlite:///my_data1.db
Done.

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [16]:
df_cca = %sql select * from SPACEXTABLE where Launch_Site like '%CCA%'
df_cca = df_cca.DataFrame()
df_cca.head()

 * sqlite:///my_data1.db
Done.

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [26]:
df_payload_mass = %sql SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Customer LIKE '%NASA (CRS)%'
df_payload_mass = df_payload_mass.DataFrame()
df_payload_mass

 * sqlite:///my_data1.db
Done.

   SUM(PAYLOAD_MASS__KG_)
0                   48213

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [27]:
avg_payload_mass = %sql SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Booster_Version LIKE '%F9 v1.1%'
avg_payload_mass = avg_payload_mass.DataFrame()
avg_payload_mass

 * sqlite:///my_data1.db
Done.

   AVG(PAYLOAD_MASS__KG_)
0             2534.666667

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [28]:
first_launch_date = %sql SELECT MIN(Date) FROM SPACEXTABLE
first_launch_date = first_launch_date.DataFrame()   
first_launch_date

 * sqlite:///my_data1.db
Done.

    MIN(Date)
0  2010-06-04

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [29]:
booster_version_counts = %sql SELECT Booster_Version, COUNT(*) as count FROM SPACEXTABLE GROUP BY Booster_Version ORDER BY count DESC
booster_version_counts = booster_version_counts.DataFrame() 
booster_version_counts

 * sqlite:///my_data1.db
Done.

   Booster_Version  count
0          F9 v1.1      5
1    F9 v1.1 B1018      1
2    F9 v1.1 B1017      1
3    F9 v1.1 B1016      1
4    F9 v1.1 B1015      1
..             ...    ...
92   F9 B4 B1039.1      1
93  F9 B4  B1043.2      1
94  F9 B4  B1041.2      1
95  F9 B4  B1040.2      1
96  F9 B4  B1039.2      1

[97 rows x 2 columns]

### Task 7




##### List the total number of successful and failure mission outcomes

In [32]:
no_of_launches = %sql SELECT COUNT(*), Mission_Outcome FROM SPACEXTABLE GROUP BY Mission_Outcome
no_of_launches = no_of_launches.DataFrame()
no_of_launches

 * sqlite:///my_data1.db
Done.

   COUNT(*)                   Mission_Outcome
0         1               Failure (in flight)
1        98                           Success
2         1                          Success
3         1  Success (payload status unclear)

### Task 8



##### List all the booster_versions that have carried the maximum payload mass, using a subquery with a suitable aggregate function.

In [33]:
max_payload_boosters = %sql \
SELECT DISTINCT Booster_Version \
FROM SPACEXTABLE \
WHERE PAYLOAD_MASS__KG_ = ( \
    SELECT MAX(PAYLOAD_MASS__KG_) \
    FROM SPACEXTABLE \
)

max_payload_boosters = max_payload_boosters.DataFrame()
max_payload_boosters

 * sqlite:///my_data1.db
Done.

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [34]:
df_2015_failures = %sql \
SELECT substr(Date, 6, 2) AS Month, \
       Landing_Outcome, \
       Booster_Version, \
       Launch_Site \
FROM SPACEXTABLE \
WHERE substr(Date, 1, 4) = '2015' \
AND Landing_Outcome LIKE 'Failure (drone ship)%'

df_2015_failures = df_2015_failures.DataFrame()
df_2015_failures

 * sqlite:///my_data1.db
Done.

  Month       Landing_Outcome Booster_Version  Launch_Site
0    01  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1    04  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [35]:
landing_rank = %sql \
SELECT Landing_Outcome, \
       COUNT(*) AS Outcome_Count \
FROM SPACEXTABLE \
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20' \
GROUP BY Landing_Outcome \
ORDER BY Outcome_Count DESC

landing_rank = landing_rank.DataFrame()
landing_rank

 * sqlite:///my_data1.db
Done.

          Landing_Outcome  Outcome_Count
0              No attempt             10
1    Success (drone ship)              5
2    Failure (drone ship)              5
3    Success (ground pad)              3
4      Controlled (ocean)              3
5    Uncontrolled (ocean)              2
6     Failure (parachute)              2
7  Precluded (drone ship)              1

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>